##############################################################
# git cherry-pick
##############################################################
$ git cherry-pick [COMMIT_NM]       # 선택하여 합치기
$ git cherry-pick -n [COMMIT_NM]    # 커밋하지 않고 선택하여 합치기


##############################################################
# git rebase | 브랜치 합병
##############################################################
$ git rebase





##############################################################
# git revert | 지정한 커밋 해시의 변경 이력을 취소
##############################################################
# revert : 원격에 있는 내용으로 변경 사항 취소하는 것 (원격에 있는거 로컬에 적용)
$ git revert
$ git revert [커밋 해시]