##############################################################
# dev 작업 후 master에 merge하기
##############################################################
$ git checkout master

$ git merge develop

##############################################################
# merge 충돌 해결 후
##############################################################
$ git add .

$ git commit -m "merge"

$ git push origin master

##############################################################
# merge 충돌 해결 후 error 발생 시
##############################################################
Committing is not possible because you have unmerged files.

$ git commit -am 'message'
